Revit 2026 API

# WorksetConfigurationOpen Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Open(
	IList<WorksetId> worksetsToOpen
)
```
```vb
Public Sub Open (
	worksetsToOpen As IList(Of WorksetId)
)
```
```cpp
public:
void Open(
	IList<WorksetId^>^ worksetsToOpen
)
```
```fsharp
member Open :
        worksetsToOpen : IList<WorksetId> -> unit
```

#### Parameters

worksetsToOpen IListWorksetId

#### Reference

WorksetConfiguration Class

Autodesk.Revit.DB Namespace